Carnet: 201504464
Grupo: 5
X : 5 + (6 + 4) = 15

Maquina Dirección Ip Gateway
1 192.168.151.0/24 192.168.151.1
2 192.168.151.0/24 192.168.151.1
3 192.168.152.0/24 192.168.152.1
4 192.168.152.0/24 192.168.152.1
5 192.168.153.0/24 192.168.153.1
6 192.168.153.0/24 192.168.153.1

conexión Dirección de Red Primera Direccion Asignable Gateway
R1-R2 172.151.0.0/16 172.151.0.1 N.A.
R1-R3 172.152.0.0/16 172.152.0.1 N.A.
R2-R3 172.153.0.0/16 172.153.0.1 N.A.

COMANDOS
VPCs
VPC1
ip 192.168.151.10 255.255.255.0 192.168.151.1
save

VPC2
ip 192.168.151.20 255.255.255.0 192.168.151.1
save

VPC3
ip 192.168.152.10 255.255.255.0 192.168.152.1
save

VPC4
ip 192.168.152.20 255.255.255.0 192.168.152.1
save

VPC5
ip 192.168.153.10 255.255.255.0 192.168.153.1
save

VPC6
ip 192.168.153.20 255.255.255.0 192.168.153.1
save

ROUTERS (INTERFACES DE COMUNICACION CON SWITCHES)
R1
configure terminal
interface f0/0
ip address 192.168.152.1 255.255.255.0
no shutdown
exit

R2
configure terminal
interface f0/0
ip address 192.168.153.1 255.255.255.0
no shutdown
exit

R3
configure terminal
interface f0/0
ip address 192.168.151.1 255.255.255.0
no shutdown
exit

ROUTERS (INTERFACES DE COMUNICACION CON VPCS)
R1->R2
configure terminal
interface s1/0
ip address 172.151.0.1 255.255.0.0
no shutdown
exit

R2->R1
configure terminal
interface s2/0
ip address 172.151.0.2 255.255.0.0
no shutdown
exit

R1->R3
configure terminal
interface s1/1
ip address 172.152.0.1 255.255.0.0
no shutdown
exit

R3->R1
configure terminal
interface s3/0
ip address 172.152.0.2 255.255.0.0
no shutdown
exit

R3->R2
configure terminal
interface s3/1
ip address 172.153.0.1 255.255.0.0
no shutdown
exit

R2->R3
configure terminal
interface s2/1
ip address 172.153.0.2 255.255.0.0
no shutdown
exit

ROUTERS (ENRUTAMIENTO ESTATICO)
R1->R2
configure terminal
ip route 192.168.153.0 255.255.255.0 172.151.0.2
exit

R2->R1
configure terminal
ip route 192.168.152.0 255.255.255.0 172.151.0.1
exit

R1->R3
configure terminal
ip route 192.168.151.0 255.255.255.0 172.152.0.2
exit

R3->R1
configure terminal
ip route 192.168.152.0 255.255.255.0 172.152.0.1
exit

R3->R2
configure terminal
ip route 192.168.153.0 255.255.255.0 172.153.0.2
exit

R2->R3
configure terminal
ip route 192.168.151.0 255.255.255.0 172.153.0.1
exit

ROUTER SHOW
sh ip int br
sh ip router

PING